<a href="https://colab.research.google.com/github/AliArabi55/Digital-Egypt-Pioneers/blob/colab/Task_Automobile_data_Edited.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

# Load the data
df = pd.read_csv("Automobile_data_Edited - Automobile_data_Edited.csv")

# Exercise 1: Print the first and last five rows

In [ ]:
print("Exercise 1: First and last five rows")
print(df.head())
print(df.tail())

Exercise 1: First and last five rows
   index      Company   body-style wheel-base  length engine-type  \
0      0  alfa-romero  convertible       88.6   168.8        dohc
1      1  alfa-romero  convertible       88.6   168.8        dohc
2      2  alfa-romero    hatchback       94.5   171.2        ohcv
3      3         audi        sedan       99.8   176.6         ohc
4      4         audi        sedan       99.4   176.6         ohc

  num-of-cylinders horsepower  average-mileage  price
0             four        111               21  13495
1             four        111               21  16500
2              six        154               19  16500
3             four        102               24  13950
4             five        115               18  17450
     index Company body-style wheel-base  length engine-type num-of-cylinders  \
200    200   volvo      sedan      109.1   188.8         ohc             four
201    201   volvo      sedan      109.1   188.8         ohc             four
202    202   volvo      sedan      109.1   188.8        ohcv              six
203    203   volvo        n.a      109.1   188.8         ohc              six
204    204   volvo      sedan      109.1   188.8         ohc             four

    horsepower  average-mileage  price
200        114               23  16845
201        160               19  19045
202        134               18  21485
203        106               26  22470
204        114               19  22625

# Exercise 2: Clean the dataset and update the CSV file

In [ ]:
print("Exercise 2: Clean the dataset")
df = df.replace(['?', 'n.a', 'NaN'], pd.NA)
df.to_csv("Automobile_data_Edited - Automobile_data_Edited.csv", index=False)

Exercise 2: Clean the dataset

# Exercise 3: Find the most expensive car company name

In [ ]:
print("Exercise 3: Most expensive car")

df['price'] = pd.to_numeric(df['price'], errors='coerce')
most_expensive_car = df[df['price'] == df['price'].max()]
print(f"Most expensive car's company: {most_expensive_car['Company'].iloc[0]}, price: {most_expensive_car['price'].iloc[0]}")

Exercise 3: Most expensive car
Most expensive car's company: mercedes-benz, price: 45400.0

# Exercise 4: Print All Toyota Cars details

In [ ]:
print("Exercise 4: All Toyota cars")
toyota_cars = df[df['Company'] == 'toyota']
print(toyota_cars)

Exercise 4: All Toyota cars
     index Company   body-style wheel-base  length engine-type  \
150    150  toyota    hatchback       95.7   158.7         ohc
151    151  toyota    hatchback       95.7   158.7         ohc
152    152  toyota    hatchback       95.7   158.7         ohc
153    153  toyota        wagon        NaN   169.7         ohc
154    154  toyota        wagon       95.7   169.7         ohc
155    155  toyota        wagon       95.7   169.7         ohc
156    156  toyota        sedan       95.7   166.3         ohc
157    157  toyota    hatchback       95.7   166.3         ohc
158    158  toyota        sedan       95.7   166.3         ohc
159    159  toyota    hatchback       95.7   166.3         ohc
160    160  toyota        sedan       95.7   166.3         ohc
161    161  toyota    hatchback       95.7   166.3        <NA>
162    162  toyota        sedan       95.7   166.3         ohc
163    163  toyota        sedan       94.5   168.7         ohc
164    164  toyota    hatchback       94.5   168.7         ohc
165    165  toyota        sedan       94.5   168.7        dohc
166    166  toyota    hatchback       94.5   168.7        dohc
167    167  toyota      hardtop       98.4   176.2         ohc
168    168  toyota      hardtop       98.4   176.2         ohc
169    169  toyota    hatchback       98.4   176.2         ohc
170    170  toyota      hardtop       98.4   176.2         ohc
171    171  toyota    hatchback       98.4   176.2         ohc
172    172  toyota  convertible       98.4   176.2         ohc
173    173  toyota        sedan      102.4   175.6         ohc
174    174  toyota        sedan      102.4   175.6         ohc
175    175  toyota    hatchback      102.4   175.6         ohc
176    176  toyota        sedan      102.4   175.6         ohc
177    177  toyota    hatchback      102.4   175.6         ohc
178    178  toyota    hatchback      102.9   183.5        <NA>
179    179  toyota    hatchback      102.9   183.5        dohc
180    180  toyota        sedan      104.5   187.8        dohc
181    181  toyota        wagon      104.5   187.8        dohc

    num-of-cylinders horsepower  average-mileage    price
150             four         62               35   5348.0
151             four        NaN               31   6338.0
152             four         62               31   6488.0
153             four         62               31   6918.0
154             four         62               27   7898.0
155             four         62               27   8778.0
156             four         70               30   6938.0
157             four         70               30   7198.0
158              NaN         56               34   7898.0
159             four         56               38   7788.0
160             four         70               38   7738.0
161             four         70               28   8358.0
162             four         70               28   9258.0
163             four         70               29   8058.0
164             four         70               29   8238.0
165             four        112               26   9298.0
166             four        112               26   9538.0
167             four        116               24   8449.0
168             four        116               24   9639.0
169             four        NaN               24   9989.0
170             four        116               24      NaN
171             four        116               24  11549.0
172             four        116               24  17669.0
173             four         92               29   8948.0
174             four         73               30  10698.0
175             four         92               27   9988.0
176             four         92               27  10898.0
177             four         92               27  11248.0
178              six        161               20  16558.0
179              six        161               19  15998.0
180              six        156               20  15690.0
181              six        156               19  15750.0

# Exercise 5: Count total cars per company

In [ ]:
print("Exercise 5: Total cars per company")
cars_per_company = df['Company'].value_counts()
print(cars_per_company)

Exercise 5: Total cars per company
Company
toyota           32
nissan           18
mazda            17
mitsubishi       13
honda            13
volkswagen       12
subaru           12
peugot           11
volvo            11
dodge             9
mercedes-benz     8
bmw               8
audi              7
plymouth          7
saab              6
porsche           5
isuzu             4
jaguar            3
chevrolet         3
alfa-romero       3
renault           2
mercury           1
Name: count, dtype: int64

# Exercise 6: Find each company’s highest price car

In [ ]:
print("Exercise 6: Highest price car per company")
highest_price_cars = df.groupby('Company')['price'].max()
print(highest_price_cars)

Exercise 6: Highest price car per company
Company
alfa-romero      16500.0
audi             23875.0
bmw              41315.0
chevrolet         6575.0
dodge            12964.0
honda            12945.0
isuzu            11048.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mercury          16503.0
mitsubishi       14869.0
nissan           19699.0
peugot           18150.0
plymouth         12764.0
porsche          37028.0
renault           9895.0
saab             18620.0
subaru           11694.0
toyota           17669.0
volkswagen       13845.0
volvo            22625.0
Name: price, dtype: float64

# Exercise 7: Find the average mileage of each car making company

In [ ]:
print("Exercise 7: Average mileage per company")
average_mileage_per_company = df.groupby('Company')['average-mileage'].mean()
print(average_mileage_per_company)

Exercise 7: Average mileage per company
Company
alfa-romero      20.333333
audi             18.857143
bmw              19.375000
chevrolet        41.000000
dodge            28.000000
honda            30.384615
isuzu            31.000000
jaguar           14.333333
mazda            25.705882
mercedes-benz    18.500000
mercury          19.000000
mitsubishi       24.923077
nissan           27.000000
peugot           22.454545
plymouth         28.142857
porsche          17.400000
renault          23.000000
saab             20.333333
subaru           26.333333
toyota           27.500000
volkswagen       28.583333
volvo            21.181818
Name: average-mileage, dtype: float64

# Exercise 8: Sort all cars by Price column

In [ ]:
print("Exercise 8: Cars sorted by price")
cars_sorted_by_price = df.sort_values(by='price')
print(cars_sorted_by_price)

Exercise 8: Cars sorted by price
     index     Company body-style wheel-base  length engine-type  \
138    138      subaru  hatchback       93.7   156.9        ohcf
18      18   chevrolet  hatchback       88.4   141.1           l
50      50       mazda  hatchback       93.1   159.1         ohc
150    150      toyota  hatchback       95.7   158.7         ohc
76      76  mitsubishi  hatchback       93.7   157.3         ohc
..     ...         ...        ...        ...     ...         ...
126    126     porsche    hardtop       89.5   168.9        ohcf
129    129     porsche       <NA>       98.4   175.7       dohcv
146    146      subaru      wagon         97   173.5        ohcf
170    170      toyota    hardtop       98.4   176.2         ohc
186    186  volkswagen      sedan       97.3   171.7         ohc

    num-of-cylinders horsepower  average-mileage   price
138             four         69               31  5118.0
18             three         48               47  5151.0
50              four         68               30  5195.0
150             four         62               35  5348.0
76              four         68               37  5389.0
..               ...        ...              ...     ...
126              six        207               17     NaN
129            eight        288               17     NaN
146             four         82               28     NaN
170             four        116               24     NaN
186             four         85               27     NaN

[205 rows x 10 columns]